
import { QuizStep } from './types';

export const QUIZ_STEPS: QuizStep[] = [
  {
    title: "Название",
    id: "objectName",
    isText: true,
    options: [],
    question: "Как называется ваш объект?"
  },
  {
    options: [
      {
        label: "Дизайн интерьера",
        id: "interiors",
        description: "Работа с внутренним пространством, мебелью и декором"
      },
      {
        description: "Экстерьерные решения, фасады, форма здания и ландшафт",
        id: "architecture",
        label: "Архитектура"
      }
    ],
    isText: true,
    question: "Что мы проектируем?пп",
    title: "Тип проекта",
    id: "projectType"
  },
  {
    question: "Выберите базовый стиль дизайна:",
    id: "style",
    options: [
      {
        label: "Неоклассика",
        id: "neoclassic",
        image: ""
      },
      {
        image: "",
        id: "artdeco",
        label: "Артдеко"
      },
      {
        id: "scandi",
        label: "Сканди"
      },
      {
        id: "min",
        label: "Минимализм"
      },
      {
        label: "Лофт",
        id: "loft"
      },
      {
        label: "Этнический",
        id: "ethnic"
      }
    ],
    title: "Стиль"
  },
  {
    id: "step_1774165175950",
    title: "Отделка стен",
    question: "Выберите варианты отделки (можно несколько):",
    isMulti: true,
    options: [
      {
        id: "opt_1774165175950",
        label: "обои"
      },
      {
        id: "opt_1774165210631",
        label: "покраска"
      },
      {
        label: "декоративная штукатурка ",
        id: "opt_1774165214111"
      },
      {
        label: "декор панели",
        id: "opt_1774165221819"
      },
      {
        label: "зеркала",
        id: "opt_1774165222837"
      },
      {
        label: "лофт",
        id: "opt_1774165224673"
      },
      {
        id: "opt_1774165225710",
        label: "текстиль и матерчатые поверхности "
      }
    ]
  },
  {
    options: [
      {
        label: "Строгие",
        id: "mc1"
      },
      {
        label: "С узором",
        id: "mc2"
      },
      {
        id: "mc3",
        label: "Классические"
      },
      {
        id: "opt_1774165387839",
        label: "Без молдингов"
      }
    ],
    title: "Молдинги и карнизы",
    question: "Тип декора стен и потолка:",
    id: "moldings"
  },
  {
    question: "Цветовая политра интерьера ",
    id: "step_1774165462844",
    title: "Новый раздел",
    options: [
      {
        label: "Монотонный интерьер  ",
        id: "opt_1774165462844"
      },
      {
        label: "Контрастный интерьер ",
        id: "opt_1774165488295"
      },
      {
        label: "Элегантный темный интерьер ",
        id: "opt_1774165489263"
      },
      {
        id: "opt_1774165490475",
        label: "Насыщенный интерьер   "
      },
      {
        id: "opt_1774165491899",
        label: "Black and white интерьер  "
      }
    ]
  },
  {
    id: "flooring",
    question: "Материал пола:",
    title: "Напольное покрытие",
    options: [
      {
        id: "fl1",
        label: "ламинат",
        description: "от 10уе м2"
      },
      {
        id: "fl2",
        label: "кварцвинил",
        description: "от 25 уе м2"
      },
      {
        id: "fl3",
        label: "Паркет инжинерная доска",
        description: "от 70уе м2"
      },
      {
        description: "от 15уе м2",
        label: "Кавролан",
        id: "fl4"
      }
    ]
  },
  {
    title: "Текстура напольного покрытия",
    options: [
      {
        id: "ft1",
        label: "Светлая"
      },
      {
        label: "Темная",
        id: "ft2"
      }
    ],
    question: "Цветовой тон пола:",
    id: "flooringTexture"
  },
  {
    question: "Тип отопления:",
    options: [
      {
        label: "Вертикальный радиатор",
        id: "rad1",
        description: "цена от 500 уе за шт"
      },
      {
        description: "цена 150 уе за шт",
        label: "Панельный радиатор",
        id: "rad2"
      },
      {
        description: "цена 700 уе за шт",
        label: "Стилизованные радиаторы",
        id: "rad3"
      }
    ],
    isMulti: false,
    id: "radiators",
    title: "Радиаторы"
  },
  {
    title: "Система кондиционирования",
    options: [
      {
        description: "цена 500 уе за шт",
        label: "Только настенный кондиционер ",
        id: "ac1"
      },
      {
        description: "цена 1500 уе за шт",
        label: "Канальная система вентиляции и кондиционирования ",
        id: "ac2"
      },
      {
        label: "Настенный кондиционер и бризер ",
        id: "opt_1774044548604"
      }
    ],
    id: "acSystem",
    question: "Тип системы кондиционирования и вентиляции:"
  },
  {
    title: "Новый раздел",
    options: [
      {
        label: "Водяной по всей площади ",
        id: "opt_1774165790211"
      },
      {
        label: "Водяной только в зонах керамогранита ",
        id: "opt_1774165801946"
      },
      {
        id: "opt_1774165803093",
        label: "Электрический только в зонах керамогранита "
      }
    ],
    question: "Отопление теплого пола:",
    id: "step_1774165790211"
  },
  {
    question: "Выберите сценарии света:",
    options: [
      {
        id: "li1",
        label: "точечные галогены"
      },
      {
        label: "трековые светильники",
        id: "li2"
      },
      {
        id: "li3",
        label: "бра"
      },
      {
        label: "торшеры",
        id: "li4"
      },
      {
        label: "люстры",
        id: "li5"
      },
      {
        label: "подсветка",
        id: "opt_1774165869859"
      }
    ],
    isMulti: true,
    id: "lighting",
    title: "Освещение"
  },
  {
    id: "step_1774165930435",
    question: "Форма потолка",
    options: [
      {
        label: "Прямой потолок из ГКЛ",
        id: "opt_1774165930435"
      },
      {
        id: "opt_1774165946578",
        label: "Прямой натяжной потолок"
      },
      {
        id: "opt_1774165947613",
        label: "Потолок с фигурами "
      }
    ],
    title: "Новый раздел"
  },
  {
    id: "step_1774166013810",
    question: "Вид примыканий ",
    options: [
      {
        label: "Потолочный теневой профиль ",
        id: "opt_1774166013810"
      },
      {
        id: "opt_1774166028144",
        label: "Теневой плинтус "
      },
      {
        label: "Теневой плинтус с подсветкой  ",
        id: "opt_1774166029069"
      },
      {
        id: "opt_1774166030010",
        label: "ЛМДФ плинтус"
      },
      {
        label: "Накладной L образный плинтус ",
        id: "opt_1774166031454"
      },
      {
        id: "opt_1774166032569",
        label: "Фриз"
      },
      {
        label: "Накладной металлический профиль ",
        id: "opt_1774166033713"
      },
      {
        label: "Накладной скрытый плинтус",
        id: "opt_1774166034810"
      }
    ],
    title: "Новый раздел"
  },
  {
    title: "Сан узел ",
    id: "tileTexture",
    options: [
      {
        label: "Монотонная",
        id: "tt1"
      },
      {
        id: "tt2",
        label: "Контрастная"
      },
      {
        label: "Насыщенная",
        id: "tt3"
      }
    ],
    isMulti: true,
    question: "Выберите цветовую гамму сан узла"
  },
  {
    id: "tileFormat",
    title: "Формат керамогранита",
    question: "Размер плитки (можно несколько):",
    isMulti: true,
    options: [
      {
        label: "размер 1,20х0,60",
        id: "tf1",
        description: "цена от 15уе м2"
      },
      {
        id: "tf2",
        label: "размер 1,50х0,75",
        description: "цена от 20уе м2"
      },
      {
        id: "tf3",
        label: "крупноформатный 3х1",
        description: "от 100уе м2"
      },
      {
        label: "декоративная плитка",
        id: "tf4",
        description: "от 100уе м2"
      }
    ]
  },
  {
    options: [
      {
        id: "opt_1774166283373",
        label: "Однотонная"
      },
      {
        id: "opt_1774166299270",
        label: "С прожилками натурального камня "
      },
      {
        label: "Глянцевая",
        id: "opt_1774166300204"
      },
      {
        label: "Матовая",
        id: "opt_1774166301152"
      }
    ],
    title: "Новый раздел",
    id: "step_1774166283373",
    question: "Тип поверхности (можно несколько):"
  },
  {
    id: "plumbingColor",
    title: "Цвет сантехники",
    question: "Цвет металла сантехнических приборов",
    options: [
      {
        id: "pl1",
        label: "хром"
      },
      {
        id: "pl2",
        label: "брашед"
      },
      {
        label: "брашед голд",
        id: "pl3"
      },
      {
        label: "брашед роз голд",
        id: "pl4"
      },
      {
        label: "Ган грей",
        id: "pl5"
      }
    ],
    isMulti: true
  },
  {
    question: "Зона купания ",
    isMulti: true,
    options: [
      {
        id: "opt_1774166472779",
        label: "Только душевая "
      },
      {
        label: "Только ванна ",
        id: "opt_1774166481477"
      },
      {
        label: "Душевая и альтернативная ванна ",
        id: "opt_1774166482564"
      },
      {
        label: "Душевая и отдельно стоящая ванна в одном сан узле ",
        id: "opt_1774166483639"
      }
    ],
    id: "step_1774166472779",
    title: "Новый раздел"
  },
  {
    id: "step_1774166538737",
    question: "Сушилка",
    options: [
      {
        label: "Электрическая",
        id: "opt_1774166538737"
      },
      {
        label: "Водяная",
        id: "opt_1774166559152"
      }
    ],
    title: "Новый раздел"
  },
  {
    title: "Новый раздел",
    options: [
      {
        label: "Минимальная необходимая кухня ",
        id: "opt_1774166579954"
      },
      {
        label: "Полноценная рабочая кухня ",
        id: "opt_1774166602172"
      }
    ],
    question: "Кухня",
    id: "step_1774166579954"
  },
  {
    id: "step_1774166617960",
    question: "Кухонный остров ",
    options: [
      {
        label: "Рабочая зона на острове ",
        id: "opt_1774166617960"
      },
      {
        id: "opt_1774166631100",
        label: "Кухонный остров с баром "
      },
      {
        label: "Без острова ",
        id: "opt_1774166633056"
      }
    ],
    title: "Новый раздел"
  },
  {
    title: "Новый раздел",
    options: [
      {
        label: "Стеклянные фасады ",
        id: "opt_1774166662746"
      },
      {
        label: "Только глухие фасады ",
        id: "opt_1774166680327"
      }
    ],
    id: "step_1774166662746",
    question: "Фасады кухни "
  },
  {
    id: "step_1774166697944",
    question: "Техника",
    title: "Новый раздел",
    options: [
      {
        id: "opt_1774166697944",
        label: "Стиральная машина с функцией сушки "
      },
      {
        label: "ТВ",
        id: "opt_1774166723070"
      },
      {
        label: "Проектор",
        id: "opt_1774166724070"
      },
      {
        label: "Станция робота пылесоса ",
        id: "opt_1774166725295"
      },
      {
        label: "Очиститель увлажнитель воздуха в каждом помещении ",
        id: "opt_1774166726226"
      },
      {
        id: "opt_1774166726988",
        label: "Стирально сушильная машина "
      },
      {
        label: "Электро плита ",
        id: "opt_1774166728161"
      },
      {
        id: "opt_1774166728963",
        label: "Газовая плита "
      },
      {
        label: "Вытяжка",
        id: "opt_1774166729721"
      },
      {
        label: "Встроенный холодильник 70см ",
        id: "opt_1774166731061"
      },
      {
        label: "Встроенный холодильник 120см ",
        id: "opt_1774166731848"
      },
      {
        label: "Полувстраеваемый холодильник 110см ",
        id: "opt_1774166732596"
      },
      {
        label: "Микроволновая печь ",
        id: "opt_1774166733345"
      },
      {
        id: "opt_1774166734524",
        label: "Духовая печь "
      },
      {
        id: "opt_1774166735492",
        label: "Духовая печь с функцией микроволновки "
      },
      {
        id: "opt_1774166736511",
        label: "Посудомоечная машина 45см "
      },
      {
        label: "Посудомоечная машина 60см ",
        id: "opt_1774166737219"
      },
      {
        label: "Фильтр питьевой воды для кухни ",
        id: "opt_1774166737928"
      },
      {
        id: "opt_1774166739179",
        label: "Измельчитель бытовых отходов "
      },
      {
        id: "opt_1774166740051",
        label: "Встроенная в потолок аудиосистема "
      },
      {
        label: "Видеонаблюдение",
        id: "opt_1774166740712"
      },
      {
        label: "Минибар",
        id: "opt_1774166741628"
      }
    ]
  },
  {
    title: "Новый раздел",
    options: [
      {
        id: "opt_1774167035396",
        label: "Отдельная гардеробная "
      },
      {
        label: "Рабочая зона",
        id: "opt_1774167051483"
      },
      {
        id: "opt_1774167052493",
        label: "Трюмо"
      }
    ],
    question: "Функционал спальни ",
    id: "step_1774167035396"
  }
];
